# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  

Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. 
Make sure you import pandas.

In [1]:
#Write your code here

Use the dtypes attribute to view how each column is stored

In [2]:
#Write your code here

Slice the first two columns using .loc and store the result in a variable called result_1.

In [3]:
#Write you code here

Slice the first two rows using .loc and store the result in a variable called result_2.

In [4]:
#Write you code here

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [5]:
#Write your code here

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [6]:
#Write your code here

Store the number rows in a variable called num_rows.

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [37]:
#Write your code here

2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [7]:
#Write your code here

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [8]:
#Write you code here

Create a column called "total", which is the product of the price and num_item columns.

In [9]:
#Write your code here

What is the average price of the three most expensive purchases?

In [10]:
#Write your code here

How many different products are there?

In [11]:
#Write your code here

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [12]:
#Write your code here

Use the drop() method to delete the column total from the dataframe df_data.

In [13]:
#Write your code here

Let's dig a little deeper into the data set and answer some basic question.

In [14]:
#Write your code here

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [15]:
#Write your code here

#hint: re-read the file (argument in read_csv: parse_dates)

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [16]:
#Write your code here

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [17]:
#Write your code here

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [18]:
#Write your code here

import pandas as pd

df_titanic = pd.read_csv("./data/Titanic.csv")

df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [19]:
#Write your code here

Change the index of the df_titanic to the column PasengerID.

In [20]:
#Write your code here

Select the name of passenger 896

In [21]:
#Write your code here

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [22]:
#Write your code here

How many missing entries are there in the Age column? 
Hint: Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [23]:
#Write you code here

Compute the avg age of passengers ignoring the missing data.

In [24]:
#Write your code here

Using the fillna() method replace the missing values in the Age column with the mean.

In [25]:
#Write your code here

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [26]:
#Write your code here